const T = require("./twitterClient");

const SalaTweet = async () => {
	const tweet = {
		status:
			"إِنَّ ٱللَّهَ وَمَلَٰٓئِكَتَهُۥ يُصَلُّونَ عَلَى ٱلنَّبِىِّ ۚ يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ صَلُّواْ عَلَيْهِ وَسَلِّمُواْ تَسْلِيمًا",
	};

	try {
		const result = await T.post("statuses/update", tweet);
		console.log("SalaTweet");
	} catch (err) {
		console.log(err);
	}
};

const ManarTweet = async () => {
	const tweet = {
		status:
			"اللهم ارحم منار السيد واغفر لها ذنبها وادخلها فسيح جناتك واجعل مرضها شفيعا لها يوم القيامه",
	};

	try {
		const result = await T.post("statuses/update", tweet);
		console.log("ManarTweet");
	} catch (err) {
		console.log(err);
	}
};

let duaa = [
	"اللَّهُمَّ إنِّي أعُوذُ بكَ مِنَ العَجْزِ والكَسَلِ، والجُبْنِ والبُخْلِ والهَرَمِ، وأَعُوذُ بكَ مِن عَذابِ القَبْرِ، وأَعُوذُ بكَ مِن فِتْنَةِ المَحْيا والمَماتِ",

	"أستغفِرُ اللهَ، الذي لا إله إلا هو، الحَيَّ القيومَ، وأتوبُ إليه",
	"اللَّهُمَّ إنِّي أَعُوذُ بكَ مِن زَوَالِ نِعْمَتِكَ، وَتَحَوُّلِ عَافِيَتِكَ، وَفُجَاءَةِ نِقْمَتِكَ، وَجَمِيعِ سَخَطِكَ",

	"اللَّهمَّ إنِّي أسألُكَ العفوَ والعافيةَ، في الدُّنيا والآخرةِ، اللَّهمَّ إنِّي أسألُكَ العفوَ والعافيةَ، في دِيني و دُنيايَ، وأهلي ومالي، اللَّهمَّ استُرْ عَوراتي، و آمِنْ رَوعاتِي",

	"اللهمَّ إنِّي أسألُك من الخيرِ كلِّه عاجلِه وآجلِه ما علِمتُ منه وما لم أعلمُ، وأعوذُ بك من الشرِّ كلِّه عاجلِه وآجلِه ما علِمتُ منه وما لم أعلمُ.  ",
	"اللهمَّ إنِّي أسألُك الجنةَ وما قرَّب إليها من قولٍ أو عملٍ، وأعوذُ بك من النارِ وما قرَّب إليها من قولٍ أو عملٍ، وأسألُك أنْ تجعلَ كلَّ قضاءٍ قضيتَه لي خيرًا، وأعوذُ بك من شرِّ كلَّ قضاءٍ قضيتَه لي شرًا",

	"اللهمَّ إنِّي أسألُك من خيرِ ما سألَك به عبدُك ونبيُّك، وأعوذُ بك من شرِّ ما عاذ به عبدُك ونبيُّك.",

	"اللَّهُمَّ اغْفِرْ لي ما قَدَّمْتُ وَما أَخَّرْتُ، وَما أَسْرَرْتُ وَما أَعْلَنْتُ، وَما أَسْرَفْتُ، وَما أَنْتَ أَعْلَمُ به مِنِّي، أَنْتَ المُقَدِّمُ وَأَنْتَ المُؤَخِّرُ، لا إلَهَ إلَّا أَنْتَ",

	"اللَّهُمَّ بَاعِدْ بَيْنِي وبيْنَ خَطَايَايَ، كما بَاعَدْتَ بيْنَ المَشْرِقِ والمَغْرِبِ، اللَّهُمَّ نَقِّنِي مِنَ الخَطَايَا كما يُنَقَّى الثَّوْبُ الأبْيَضُ مِنَ الدَّنَسِ، اللَّهُمَّ اغْسِلْ خَطَايَايَ بالمَاءِ والثَّلْجِ والبَرَدِ",

	"اللهم انك عفو تحب العفو فاعف عنا",
	"اللهم إني أسألك الثبات في الأمر والعزيمة على الرشد، وأسألك موجبات رحمتك وعزائم مغفرتك، وأسألك شكر نعمتك وحسن عبادتك، وأسألك قلبًا سليمًا ولسانًا صادقًا، وعملا متقبلا",
	"اللهم إني أعوذ بك من ساعة السوء و يوم السوء و ليلة السوء و صديق السوء و جار السوء و أعوذ بك من ذو الوجهين و ذو اللسانين",
	" رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
	"اللهم أرنا الحق حقا وارزقنا اتباعه و أرنا الباطل باطلا وارزقنا اجتنابه",
	"اللهم ارزقنا العفو و العافية بالدنيا و الآخرة",
];

const duaaTweet = async () => {
	const tweet = {
		status: duaa[Math.floor(Math.random() * duaa.length)],
	};

	try {
		const result = await T.post("statuses/update", tweet);
		console.log("duaaTweet");
	} catch (err) {
		console.log(err);
	}
};

// export tweets
module.exports = { duaaTweet, ManarTweet, SalaTweet };
